MicroControllerReal/ESP32S3WebServerProject/Software/ESP32S3WebserverProject/ESP32S3WebserverProject.ino
/* The ESP32 S3 Webserver Project Copyright (c) 2024 MicroControllerReal

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.
*/

// The ESP32 S3 Webserver Project software
// An easily customizable webserver template designed for easy but flexible and performant use.
// Requires an ESP32, S3 preferred
// A WiFi connection is recommended. Can work without but with limited features. (No TimeSynch with internet NTP server, No Telegram messages)
// Optionally supports either a SD (up to 32GB) or MMC card (up to 2TB and faster than SD, thus preferred)
// Optionally supports LittleFS for files in flash memory
// Does not support SPIFFS as it has been deprecated and replaced with LittleFS
// Optionally provides a webpage file manager to list, delete, upload and download to/from SD/MMC and/or LittleFS, including directories.
// Uploading files with the file manager supports a client side progress bar
// Optionally provides Serial output over a webpage (SerialWS). Useful for seeing what errors have occurred without needing a USB cable.
// Does not use an external RTC chip but does synch to an internet time server periodically, ensuring accuracy
// Supports timezones, to include standard and daylight saving time where appropriate
// Uses ESP32 "Preferences" for parameter storage
// Optionally supports OTA (Over The Air, WiFi based loading of sketches to flash memory)
// Optionally supports sending and/or receiving Telegram messages to/from one or two pre-defined recipients.
// NOTE: The ESP32 S3 Webserver Project hardware PVB board can be used. That board also supports a 480 x 320 TFT and optionally a Touchpad.
//       Graphics and touch are not implemented in this webserver template, but can easily be added as a customization.
//       See the example (Appendix D) in the documentation for implementing graphics as a project customization.

#include "WebServerDefines.h"         // Webserver specific definitions
#include "customize.h"                // customize.h contains settings to customize the webserver

// Perform sanity checks on SDType and StandardFiles at compile time
#if ! ((SDType == TypeSD) || (SDType == TypeMMC) || (SDType == TypeNoSD))
  #error Invalid SD Type
#endif
#if ((StandardFiles == onLFS) || (StandardFiles == onSD))
  #if(StandardFiles == onSD)
    #if!((SDType == TypeSD) || (SDType == TypeMMC))
      #error StandardFiles on SD but no SD defined
    #endif
  #else
    #if !(UseLittleFS)
      #error StandardFiles on LittleFS but LittleFS not defined
    #endif
  #endif
#else
  #error Invalid StandardFiles setting
#endif

#if defined(CONFIG_IDF_TARGET_ESP32C3) ||defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3) 
  #include "driver/temp_sensor.h"     // Provides temperature sensing for the ESP32S3 chip
#endif
#include <Preferences.h>              // Provides for configuration parameters stored as ESP32 preferences
#include <Time.h>                     // Provides time conversion and NTP synchronization
#include <WiFi.h>                     // Provides WiFi connectivity
#include <ESPAsyncWebServer.h>        // Provides asynchronous web server support for up to 8 clients
#include <ESPmDNS.h>                  // Allows this server to be resolved in local network
#include <SPI.h>                      // Necessary for SPI communications (SD, MMC, Graphics, ...)
#include <ArduinoJson.h>              // Necessary for Telegram and JSON styled WebSocket requests and responses
#if (SDType == TypeSD)
  #include <SD.h>                     // Provides for files on an SD card. 32GB Max!
#endif
#if (SDType == TypeMMC)
  #include <SD_MMC.h>                 // Provides for files on an MMC card. 2TB max and faster than SD!
  #define SD SD_MMC                   // Allows the exact same programming for SD_MMC as SD (without having to use SD_MMC.open, etc.)
#endif
#if UseLittleFS
  #include <LittleFS.h>               // Provides a file system in flash memory
#endif
#if UseOTA
  #include <ArduinoOTA.h>             // Provides for updating sketch over the air (using WiFi instead of USB)
#endif
#if (UseTelegram == TelegramSend) || (UseTelegram == TelegramReceive) || (UseTelegram == TelegramSendReceive)
  #include <WiFiClientSecure.h>
  #include <UniversalTelegramBot.h>
#endif
#if useSerialWS
  #include <SerialWS.h>               // Provides a web based Serial Monitor. Requires SerialWS.htm
#endif

const char Firmware[] = "1.3";        // Version of The ESP32S3 Webserver Project software (this program)
// Version history:
// 1.0 Initial version with all features. Developed over time of about Jan-Jun 2024
// 1.1 Bug corrections. Redesign of Telegram messaging to enable multiple bots (mainly to allow for alarms
//     from a second bot with distinct ringtones client side)
// 1.2 Added a blocked area of mass storage that is invisible and protected in file manager. Added safetyNet
//     features (reboot every n days, reboot on low memory, reboot on low heap size)
// 1.3 Made MMC card SPI speed configurable, with default of BOARD_MAX_SDMMC_FREQ (maximum speed defined by board)
//     Added customization for MMC 1 bit mode. Slower, but could provide additional GPIO pins if necessary
//     Removed telegram messaging and time synchronization if running without WiFi (AP mode only).
//     Cleaned up use of setupVerbose when not using Serial (it was wasting program space!)
//     Added Server Running Time to status.
//     Added comments in customize.h about swapping SD CS and TFT CS beginning with version 3.0 of the hardware.
//     Added embedFileman option (helps initially load files to mass storage)
// Future plans
//     Serve resources from a data structure instead of programming each separately. Reduces program size.
//     Improve ability to serve gzip compressed files. This reduces file sizes and thus network traffic and can increase performance.
//     Add serving files directly from PSRAM to make the server even more performant. (? Tests needed!)
//     Rewrite as a super library to reduce programming clutter and maintenance.

// Keep the parameters as global variables. They are used in the websocket events, etc
// and therefore need to be quickly available. Loading multiple parameters from Preferences
// may take too long and cause performance problems or even kick the watchdog...
char ssid[32];                        // Name of WiFi SSID to connect to
char password[64];                    // Password to connect to that WiFi SSID
// hostname will be used by mDNS so that the server can be reached at that name from the local network (i.e. http://myProject)
// hostname will be used as the name for uploading new firmware over the air (OTA)
// hostname + "AP" will be used as the name the access point is established for
char hostname[32] = "";               // Name of this server
char appasswd[64] = "";               // Password users must supply to access this access point
bool beacon = NULL;                   // Will the AP SSID beacon be on or off (AP hidden)?
char adminUsername[32] = "";          // Administrative logon for configuration and file manager
char adminPassword[32] = "";          // Administrative password for configuration and file manager
char timezone[64] = "";               // Local timezone definition, including DST. Limited in admin.htm to 50 characters on input
char ntpserver[64] = "";              // Name of NTP server to synchronize time to. Limited in admin.htm to 35 characters on input

#if (UseTelegram == TelegramSend) || (UseTelegram == TelegramReceive) || (UseTelegram == TelegramSendReceive)
  char tgChatID[12] = CHAT_ID;
  char tgAltChatID[12] = ALT_CHAT_ID;
  int numBots = sizeof(Bots) / sizeof(Bots[0]);
#endif

