MicroControllerReal/ESP32S3WebServerProject/Software/ESP32S3WebserverProject/ESP32S3WebserverProject.ino
AsyncWebServer server(80);                 // Create Asynchronous Web Server object on port 80
AsyncWebSocket ws("/ws");                  // Create Asynchronous Web Socket handler
AsyncEventSource events("/events");
uint32_t lastNTPSynch;                     // millis() when last NTP synch occurred
tm currentTime;                            // Current time.
int64_t lastReboot=0;                      // micros() when the server was started

#if UseOTA 
  bool activeOTA = false;                  // Will be true during OTA updates
#endif

#if useSerialWS
  SerialWS serialWS;                       // Implements the web based Serial Monitor
#endif

void setup(){

#if serialEnabled
  Serial.begin(serialBaud);                // Start serial output at designated baud (speed)
  Serial.setDebugOutput(true);
#if setupVerbose
  serialPrint("\n\nInitializing\n",true);  // Blank lines first because ESP32 may output some info at boot
#endif
#endif // serialEnabled

  customEarlySetup();                      // Execute custom early setup. Required for customizations, if any.
  
  initParams();                            // Read all parameters from preferences. Do first init if necessary.

#if UseLittleFS
  initLittleFS();                          // Initialize LittleFS (files in flash)
#endif

#if ((SDType == TypeSD)  || (SDType == TypeMMC))
  initSDCard();                            // Start the SD or SD_MMC card and library
#endif

  startWiFi();                             // Start access point if configured, connect to WiFi if configured!

#if UseOTA
  initOTA();                               // Initiate OTA-Over The Air firmware update service
#endif

  initMDNS();                              // Initiate MDNS so the webserver is available in the local network under its name

  if(WiFi.isConnected()){
#if serialEnabled && setupVerbose
    {  char buff[200];
       snprintf(buff,200,"Synchronizing time to: %s", ntpserver);
       serialPrint(buff,true);
    }
#endif
    int count=0;
    while(!synchDateTime()){               // Synchronize date & time to NTP server. Configure timezone and DST){
#if serialEnabled && setupVerbose
      serialPrint(".",false);
#endif
      if(++count>9){
#if serialEnabled && setupVerbose
        serialPrint("\nSynchronization failed!\n",true);
#endif
        break;
      }
    }
#if serialEnabled && setupVerbose
    serialPrint("\n",false);
#endif
  }
#if serialEnabled && setupVerbose
  serialPrint("Initiating Server\n",true);
#endif
  ws.onEvent(onWsEvent);                   // Server will call function onWsEvent when websocket events occur
  server.addHandler(&ws);

  events.onConnect([](AsyncEventSourceClient *client){});
  server.addHandler(&events);              // Configure server to handle connection events

#if UseStatus
  //The /status should never be cached as it is a "moment in time" response
  //status is designed primarily for debugging purposes
  server.on("/status", HTTP_GET, [](AsyncWebServerRequest *request){
    char stat[1000];
    serverStatus(stat);
    textToHTML(stat, sizeof(stat));
    request->send(200, "text/html", stat);
  });
#endif

  // Favicon will be cached on the client. It is setup here because the browser will always request
  // "favicon.ico" but the file may be called something else or stored who knows where.
  // If not specifically declared, the server routines here would look for favicon.ico,
  // not find it, and tell the browser that none exists.
  server.on("/favicon.ico",HTTP_GET, [](AsyncWebServerRequest *request){
    responseWithCaching(request, FavIcon);
  });

  server.on("/admin", HTTP_GET, [](AsyncWebServerRequest *request){
    if(adminAllowed(request)) responseWithCaching(request, AdminHTM);
  });

#if useSerialWS
  // Start the SerialWS listener on this server
  serialWS.begin(&server, SerialWStxSize, SerialWSrxSize);
  // Register the SerialWS webpage
  server.on("/SerialWS", HTTP_GET, [](AsyncWebServerRequest *request){
    if(adminAllowed(request)) responseWithCaching(request, SerialHTM);
  });
#endif

#if (UseFileManager)
  setupFileManager();                      // Set up everything for the web based file manager
#endif
  
#if defined(CONFIG_IDF_TARGET_ESP32C3) ||defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3) 
  // Configure and start the MCU internal temperature sensor
  // Name          range °C  error
  // TSENS_DAC_L0  50 ~ 125  < 3 °C
  // TSENS_DAC_L1  20 ~ 100  < 2 °C
  // TSENS_DAC_L2 -10 ~ 80   < 1 °C  (Default)
  // TSENS_DAC_L3 -30 ~ 50   < 2 °C
  // TSENS_DAC_L4 -40 ~ 20   < 3 °C
  temp_sensor_config_t temp_sensor = TSENS_CONFIG_DEFAULT();
  temp_sensor.dac_offset = TSENS_DAC_L2;
  temp_sensor_set_config(temp_sensor);
  temp_sensor_start();
#endif
  
  customPages();

// If both LittleFS and SD/MMC are being used, set up prefixing so that the webserver knows where files are located
// NOTE: Files other than the standard files (favicon.ico, admin.htm, DefaultHTM) referred to within webpages MUST
// adhere to the prefixing! Use /f/ for files on LittleFS and /s/ for files on SD/MMC!
#if (UseLittleFS) && ((SDType == TypeSD) || (SDType == TypeMMC))
    // Files on the SD will be prefixed with /s/, but the "/s/" will be reduced to "/" for the path on the SD
    // and files will be cached on the client
    server.serveStatic("/s/",SD,"/").setCacheControl(cacheRule);
    // Files in littleFS will be prefixed with /f/, but the "/f/" will be reduced to "/" for the path
    // in littleFS and files will be cached on the client
    server.serveStatic("/f/",LittleFS,"/").setCacheControl(cacheRule);
#endif
  // on "/" MUST be last in the list otherwise it will be used before other options are even considered!
  #if (StandardFiles == onSD)
    server.serveStatic("/", SD, "/").setDefaultFile(DefaultHTM).setCacheControl(cacheRule);
  #endif
  #if (StandardFiles == onLFS)
    server.serveStatic("/", LittleFS, "/").setDefaultFile(DefaultHTM).setCacheControl(cacheRule);
  #endif

  server.onNotFound([](AsyncWebServerRequest *request){
    serialPrint("NOT_FOUND: ",false);
    if(request->method() == HTTP_GET)
      serialPrint("GET",false);
    else if(request->method() == HTTP_POST)
      serialPrint("POST",false);
    else if(request->method() == HTTP_DELETE)
      serialPrint("DELETE",false);
    else if(request->method() == HTTP_PUT)
      serialPrint("PUT",false);
    else if(request->method() == HTTP_PATCH)
      serialPrint("PATCH",false);
    else if(request->method() == HTTP_HEAD)
      serialPrint("HEAD",false);
    else if(request->method() == HTTP_OPTIONS)
      serialPrint("OPTIONS",false);
    else
      serialPrint("UNKNOWN",false);
      
    {  char buff[1000];
       snprintf(buff,1000," http://%s%s\n", request->host().c_str(), request->url().c_str());
       serialPrint(buff,false);
    }

