MicroControllerReal/ESP32S3WebServerProject/Software/ESP32S3WebserverProject/ESP32S3WebserverProject.ino
    if(request->contentLength()){
      {  char buff[1000];
         snprintf(buff,1000,"_CONTENT_TYPE: %s\n_CONTENT_LENGTH: %u\n", request->contentType().c_str(), request->contentLength());
         serialPrint(buff,false);
      }
    }

    int headers = request->headers();
    int i;
    for(i=0;i<headers;i++){
      AsyncWebHeader* h = request->getHeader(i);
      {  char buff[1000];
         snprintf(buff, 1000, "_HEADER[%s]: %s\n", h->name().c_str(), h->value().c_str());
         serialPrint(buff,false);
      }
    }

    int params = request->params();
    for(i=0;i<params;i++){
      AsyncWebParameter* p = request->getParam(i);
      if(p->isFile()){
        {  char buff[1000];
           snprintf(buff, 1000,"_FILE[%s]: %s, size: %u\n", p->name().c_str(), p->value().c_str(), p->size());
           serialPrint(buff,false);
        }
      } else if(p->isPost()){
        {  char buff[1000];
           snprintf(buff, 1000, "_POST[%s]: %s\n", p->name().c_str(), p->value().c_str());
           serialPrint(buff,false);
        }
      } else {
        {  char buff[1000];
           snprintf(buff, 1000, "_GET[%s]: %s\n", p->name().c_str(), p->value().c_str());
           serialPrint(buff,false);
        }
      }
    }
    serialPrint(" ",true);
    request->send(404);
  });

  validateFiles();
  customLateSetup();                                    // Execute late custom setup, required for customizations, if any

#if serialEnabled && setupVerbose
  serialPrint("Starting server\n",true);
#endif
  server.begin();
  lastReboot=esp_timer_get_time();
  char stat[1000];
#if serialEnabled && setupVerbose
  serialPrint("Server is online\n",false);
  serverStatus(stat);
  serialPrint(stat,false);
  serialPrint("\n",true);
#endif
#if (((UseTelegram == TelegramSend) || (UseTelegram == TelegramSendReceive)) && TelegramOnBoot)
  sprintf(stat, "%s started", hostname);
  serverStatus(stat);
  sendTelegramMsg(0, tgChatID, stat);
  if(TelegramAltOnBoot)sendTelegramMsg(0, tgAltChatID, stat);
#endif
}

bool adminAllowed(AsyncWebServerRequest *request){
#if onlyLocalAdmin
  // Only requests from this access point or same WiFi network are allowed
  if(!isLocal(request->client()->remoteIP())){
    request->send(403);
    return false;
  }
#endif
  // Only requests from users who have logged in with admin name and password are allowed
  if(!request->authenticate(adminUsername, adminPassword)){
    request->requestAuthentication();
    return false;
  }
  return true;
}

void responseWithCaching(AsyncWebServerRequest *request, char fileName[]){
#if (StandardFiles == onLFS)
  responseWithCaching(request, LittleFS, fileName);
#endif 
#if (StandardFiles == onSD)
  responseWithCaching(request, SD, fileName);
#endif
}

void responseWithCaching(AsyncWebServerRequest *request, FS fs, char fileName[]){
  AsyncWebServerResponse *response = request->beginResponse(fs, fileName);
  response->addHeader("Cache-Control", cacheRule);
  request->send(response);
}

void loop(){
#if useSafetyNet
  static unsigned long lastSafety = millis();           // Last millis() when safetyNet features were checked
#endif
  static unsigned long lastClientMaint    = -1000;      // Last millis() when old clients were maintained (inactive deleted)
#if useSerialWS
  static unsigned long lastSWSclientMaint = -500;       // Last millis() when old clients were maintained (inactive deleted) for SerialWS
#endif
  static unsigned long lastTimeSynchCheck = 0;          // Last millis() when a check for a time synch was done (Check! not actually synchronized!)
  static unsigned long lastCurrentTime    = -1000;      // Last time currentTime was updated

#if (UseTelegram == TelegramReceive) || (UseTelegram == TelegramSendReceive)
  static unsigned long lastTelegramCheck=-1000*TGRECEIVEFREQ;// Last time Telegram was checked for incoming messages
#endif
  const unsigned long timeSynch = 1000 * 60 * 60 * 6;   // Resynch time to NTP every six hours. (Failed attempts won't be retested for 5 minutes)

  bool didOne = false;                                  // Will be set true if any process actually runs. Prevent more than 1 running per pass through loop!
  bool WiFiConnected = WiFi.isConnected();              // Some processes may be skipped if no WiFi is connected

#if UseOTA
  ArduinoOTA.handle();                                  // Always handle OTA if it is enabled
  didOne = activeOTA;                                   // If OTA is Updating, do nothing else
#endif

  if((!didOne)&&((millis()-lastClientMaint)>=1000)){    // Once a second
    ws.cleanupClients();                                // Delete old client sessions
    lastClientMaint = millis();                         // Remember the last time client maintenance was done
    didOne = true;
  }

#if useSerialWS
  if((!didOne)&&((millis()-lastSWSclientMaint)>=1000)){ // Once a second
    serialWS.cleanupClients();                          // Delete old client sessions
    lastSWSclientMaint = millis();                      // Remember the last time client maintenance was done
    didOne = true;
  }
#endif

  if((!didOne) && (millis() - lastCurrentTime) > 500){  // Every half second
    getLocalTime(&currentTime,NULL);                    // Get current local time. It will be adjusted for timezone and DST!
    lastCurrentTime = millis();                         // Remember last time currentTime was updated
  }

#if (UseTelegram == TelegramReceive) || (UseTelegram == TelegramSendReceive)
  if((!didOne) && WiFiConnected && 
    ((millis() - lastTelegramCheck)/1000) >= TGRECEIVEFREQ){
      // BTW & FWIW, in testing, it took 0.7 seconds to check for messages.
      if(!getTelegramMsgs() || TGRECEIVEFREQ <= 10){    // If NO messages were received then we are done
        lastTelegramCheck = millis();
      } else {
        // If messages were received, we will check again soon to handle any additional messages
          lastTelegramCheck += 10000;                   // Force a check again in ten seconds
      }
      didOne = true;
  }
#endif

  // Call customLoop every cycle, regardless of didOne or not. This allows for high priority processes.
  // But, tell the customLoop if didOne or not so lower priority processes will be skipped over
#if UseOTA                                              // Never call customerLoop during an OTA update!
  if(!activeOTA) didOne |= customLoop(didOne);          // Execute processes, if any, required for customizations
#else
  didOne |= customLoop(didOne);                         // Execute processes, if any, required for customizations
#endif

