MicroControllerReal/ESP32S3WebServerProject/Software/ESP32S3WebserverProject/ESP32S3WebserverProject.ino
  if(WiFiConnected && (!didOne) && 
      ((millis() - lastTimeSynchCheck) >=(1000*60*5))){ // Once every 5 minutes
    if((millis() - lastNTPSynch) >= timeSynch){         // Check to see if NTP Synch is due
      synchDateTime();                                  // Synchronize time to NTP (if possible). Sets lastNTPSynch if successful!
    }
    lastTimeSynchCheck = millis();                      // We did check. Don't waste resources, even (especially!) if NTP failed!
    didOne = true;
  }

#if useSafetyNet
  if((!didOne) && millis() - lastSafety > 15000){       // Check safety net criteria every fifteen seconds
    if(
    #if safetyMinFreeHeapKB > 0
      ((ESP.getFreeHeap()/1024) < safetyMinFreeHeapKB) ||
    #endif
    #if safetyMinAllocHeapKB > 0
      ((ESP.getMaxAllocHeap()/1024) < safetyMinAllocHeapKB) ||
    #endif
    #if safetyMaxRebootDays > 0
      // From 3:00:00 - 3:59:59 daily (86400000000 = 1000 * 1000mS * 60sec * 60min * 24hrs) 
      ((currentTime.tm_hour == 3) && (((esp_timer_get_time() - lastReboot) / 86400000000) >= safetyMaxRebootDays)) ||
    #endif
    false){                                             // false, just to close the optional #ifs from above...
      serialPrint("Rebooting due to safety net issues\n",true);
      delay(1000);
      ESP.restart();
    }
  }
#endif
}

void initSDCard(){
#if (SDType == TypeSD)
  // Use normal SD card. Up to 32GB supported.
  // By default, the ESP32 SD library defaults to 4MHz
  // The "Internet" says that 40MHz also works.
  //SD::begin(uint8_t ssPin=SS, SPIClass &spi=SPI, uint32_t frequency=4000000, const char * mountpoint="/sd", uint8_t max_files=5, bool format_if_empty=false);
  // Tested! 40MHz works! Is faster, but not 10x faster!
  while(!SD.begin(SDcs, SPI, SDMHz * 1000000, "/sd", SDmaxOpenFiles, SDformatIfFail)){
    #if serialEnabled && setupVerbose
      serialPrint("SD card mount failed\n",true);
    #endif
    delay(3000);
  }
  #if serialEnabled && setupVerbose
    serialPrint("SD card mounted\n",true);
  #endif
#endif
#if (SDType == TypeMMC)
  //We have mimicked SD_MMC as SD so that the code for file access is identical for SD and SD_MMC!
  #if !(MMCChipDetect == -1)
    pinMode(MMCChipDetect, INPUT_PULLUP);
    while(digitalRead(MMCChipDetect)){
      serialPrint("Insert MMC card\n",true);
      delay(3000);
    }
  #endif
  //bool begin(const char * mountpoint="/sdcard", bool mode1bit=false, bool format_if_mount_failed=false, int sdmmc_frequency=BOARD_MAX_SDMMC_FREQ, uint8_t maxOpenFiles = 5);
  //mode1bit=true is slower, but uses fewer pins
  //Defaults are all best, assuming all data lines are available
  SD_MMC.setPins(MMCclk, MMCcmd, MMCd0, MMCd1, MMCd2, MMCd3);
  while(!SD_MMC.begin("/sdcard", MMCmode1bit, MMCformatIfFail, MMCMHz, MMCmaxOpenFiles)){
    serialPrint("MMC card mount failed\n",true);
    delay(3000);
  }
  #if serialEnabled && setupVerbose
    serialPrint("MMC card mounted\n",true);
  #endif
#endif
}

#if UseLittleFS
void initLittleFS(){
  while(!LittleFS.begin(fmtLittleFS)){
    serialPrint("LittleFS Mount Failed\n",true);
    delay(3000);
  }
#if serialEnabled && setupVerbose
  serialPrint("LittleFS mounted\n",true);
#endif
}
#endif

void serverStatus(char *stat){
  char tmp[100];                                // Temporary variable for local formatting
  stat[0]=0;                                    // Start with a "clean" output buffer
  sprintf(tmp, "%s\n%d cores at %dMHz\n", ESP.getChipModel(),ESP.getChipCores(),ESP.getCpuFreqMHz());
  strcat(stat,tmp);
  sprintf(tmp,"%uKB ",ESP.getFlashChipSize()/1024);
  strcat(stat,tmp);
  switch(ESP.getFlashChipMode()){
  case FM_QIO:
    strcat(stat,"QIO");
    break;
  case FM_QOUT:
    strcat(stat,"QOUT");
    break;
  case FM_DIO:
    strcat(stat,"DIO");
    break;
  case FM_DOUT:
    strcat(stat,"DOUT");
    break;
  case FM_FAST_READ:
    strcat(stat,"Fast Read");
    break;
  case FM_SLOW_READ:
    strcat(stat,"Slow Read");
    break;
  case FM_UNKNOWN:
    break;
  }
  uint32_t x = ESP.getFlashChipSpeed();
  if(x>0){
    sprintf(tmp," %uMhz",x/(1000*1000));
    strcat(stat,tmp);
  }
  strcat(stat," Flash\n");

#if UseLittleFS
  unsigned long total = ((long)LittleFS.totalBytes()/1024L);
  unsigned long used  = ((long)LittleFS.usedBytes()/1024L);
  unsigned long remain = ((long)total - (long)used);
  sprintf(tmp,"%uKB of %uKB free on LittleFS\n",remain,total);
  strcat(stat,tmp);
#endif

  x = ESP.getPsramSize();
  if(x > 0){
    sprintf(tmp,"%uKB of %uKB PSRAM free\n",ESP.getFreePsram()/1024,x/1024);
    strcat(stat,tmp);
  } else {
    strcat(stat,"No PSRAM\n");
  }

#if defined(CONFIG_IDF_TARGET_ESP32C3) ||defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3) 
  float MCUtempC = 0;
  temp_sensor_read_celsius(&MCUtempC);
  char pct[6];
  sprintf(tmp,"MCU Temp: %.1f°C\n", MCUtempC);
  strcat(stat,tmp);
#endif
  
  sprintf(tmp,"%uKB of %uKB heap free\n",ESP.getFreeHeap()/1024,ESP.getHeapSize()/1024);
  strcat(stat,tmp);
  sprintf(tmp,"%uKB maximum heap block\n",ESP.getMaxAllocHeap()/1024);
  strcat(stat,tmp);

#if (SDType == TypeSD) || (SDType == TypeMMC)
  uint8_t cardType = SD.cardType();
  strcat(stat,"SD card type: ");
  switch(cardType){
  case CARD_NONE:
    strcat(stat,"None");
    break;
  case CARD_MMC:
    strcat(stat,"MMC");
    break;
  case CARD_SD:
    strcat(stat,"SDSC");
    break;
  case CARD_SDHC:
    strcat(stat,"SDHC");
    break;
  default:
    strcat(stat,"UNKNOWN");
    break;
  }
  if(!(cardType==CARD_NONE)){
    unsigned long total = (SD.totalBytes()/1024L/1024L/1024L);
    unsigned long used  = (SD.usedBytes()/1024L/1024L/1024L);
    unsigned long remain = total - used;
    sprintf(tmp," %uGB of %uGB free\n",remain,total);
    strcat(stat,tmp);
  }
#endif

  sprintf(tmp,"Webserver Version: %s\n",Firmware);
  strcat(stat,tmp);
  sprintf(tmp, "Wifi Strength: %idBm %i%%\n",WiFi.RSSI(),(int)map(WiFi.RSSI(),-30,-90,100,0));
  strcat(stat,tmp);
  
  getLocalTime(&currentTime,NULL);
  sprintf(tmp,"Current Time: %04u/%02u/%02u %02u:%02u:%02u\n",currentTime.tm_year+1900,currentTime.tm_mon+1,currentTime.tm_mday,currentTime.tm_hour,currentTime.tm_min,currentTime.tm_sec);
  strcat(stat,tmp);

