MicroControllerReal/ESP32S3WebServerProject/Software/ESP32S3WebserverProject/ESP32S3WebserverProject.ino
  uptime(stat);
  
  customServerStatus(stat);
}

void uptime(char msg[]){
  int ttlSec = ((esp_timer_get_time() - lastReboot) / (1000 * 1000));
  int secs = ttlSec % 60;
  ttlSec -= secs;
  int mins = (ttlSec % 3600) / 60;
  ttlSec -= (mins * 60);
  int hrs = (ttlSec % 86400) / 3600;
  ttlSec -= (hrs * 3600);
  int dys = ttlSec / 86400;
  char buf[60];
  sprintf(buf,"Uptime: %u days, %u hours, %u minutes, %u seconds\n",dys, hrs, mins, secs);
  strcat(msg,buf);
}

// Handles web socket events
void onWsEvent(AsyncWebSocket * server, AsyncWebSocketClient * client, AwsEventType type, void * arg, uint8_t *data, size_t len){
  bool handled = false;
  switch(type){
  case WS_EVT_CONNECT:
    //Serial.printf("ws[%s][%u] connect\n", server->url(), client->id());
    break;
  case WS_EVT_DISCONNECT:
    //Serial.printf("ws[%s][%u] disconnect\n", server->url(), client->id());
    break;
  case WS_EVT_ERROR:
    //Serial.printf("ws[%s][%u] error(%u): %s\n", server->url(), client->id(), *((uint16_t*)arg), (char*)data);
    break;
  case WS_EVT_PONG:
    //Serial.printf("ws[%s][%u] pong[%u]: %s\n", server->url(), client->id(), len, (len)?(char*)data:"");
    break;
  case WS_EVT_DATA:
    AwsFrameInfo * info = (AwsFrameInfo*)arg;
    if(info->opcode == WS_TEXT){
      char operand[25];         // Assuming a maximum operand length of 24 plus terminating 0. Increase if necessary. (Or use shorter names!)
      bool JSON = data[0]=='{'; // Rudimentary test to determine if the message is in JSON format

      if(JSON){
        char* reqAddr = strstr((char*)data,"request");                // Does the data contain "request"
        if((reqAddr != NULL) && (reqAddr - (char*)data < 10)){        // within the first ten characters? If so..
          JsonDocument doc;                                           // Allocate the JSON document
          DeserializationError Jerror = deserializeJson(doc, data);    // Test if parsing succeeds and deserialize the JSON document
          
          if(Jerror){                                                  // Test if parsing succeeded
            char buff[1000];
            snprintf(buff, 1000, "deserializeJson() failed:\n%s\n%s\n",Jerror.f_str(),(char*)data);
            serialPrint(buff,true);
          } else {
            // WebSocket request appears to be in a JSON format
            // Possible methods to retrieve values:
            //  const char* sensor = doc["sensor"];                   // Implicit casting to char*
            //  long time = doc["time"];                              // Specific casting is also available
            //  double latitude;                                      // i.e. x = doc["x"].as<int>
            //     latitude = doc["data"][0];
            //  double longitude = doc["data"][1];
            // The protocol in use here requires all JSON messages to have a "request" attribute that uniquely identifies what data is requested
            // Feel free to implement your own protocols.
            const char* request = doc["request"];
            if(strcmp(request,"getDateTime") == 0){
              // Client has requested date and time settings   This event is used in /admin.htm. Could be used in custom pages as well.
              char rsvp[400];
              getDateTimeSettings(rsvp,true);
              client->text(rsvp);
              handled = true;
            }
#if(UseFileManager)
            if((!handled) && strcmp(request,"FMgetBasic") == 0){
              // Client has requested basic data for the file manager. This event is used in /FileMan.htm.
              // Return a JSON string containing hostname, file extensions allowed for edit, and a list of available file systems (SD, LittleFS,...)
              char rsvp[400] = "";
              if((!onlyLocalAdmin) || isLocal(client->remoteIP())){
                FMgetBasic(rsvp);
                client->text(rsvp);
              }
              handled = true;
            }
            if((!handled) && strcmp(request,"FMgetFS") == 0){
              // Client has requested data for a specific file system for the file manager. This event is used in /FileMan.htm.
              // Return a JSON string containing the file system, capacity, used, free. 
              const char* filesys = doc["filesys"];
              char rsvp[400] = "";
              if((!onlyLocalAdmin) || isLocal(client->remoteIP())){
                FMgetFS(rsvp,filesys);
              }
              client->text(rsvp);
              handled = true;
            }
            if((!handled) && strcmp(request,"FMgetDir") == 0){
              // Client has requested a list of directories and files in a specific path on a specific file system
              if((!onlyLocalAdmin) || isLocal(client->remoteIP())){
                const char* filesys = doc["filesys"];
                const char* dir = doc["dir"];
                client->text(FMgetDir(filesys,dir));
              }
              handled = true;
            }
            if((!handled) && strcmp(request,"FMmkDir") == 0){
              // Client has requested to create a new directory.
              if((!onlyLocalAdmin) || isLocal(client->remoteIP())){
                const char* filesys = doc["filesys"];
                const char* dir = doc["dir"];
                const char* dname = doc["dname"];
                int fsNum = getFMfsNum((char*)filesys);
                FMmkDir(fsNum, dir, dname);
                client->text(FMgetDir(filesys,dir));
              }
              handled = true;              
            }
            if((!handled) && strcmp(request,"FMdelete") == 0){
              if((!onlyLocalAdmin) || isLocal(client->remoteIP())){
                const char* filesys = doc["filesys"];
                const char* dir = doc["dir"];
                const char* fname = doc["fname"];
                int fsNum = getFMfsNum((char*)filesys);
                char fullPath[256];

