MicroControllerReal/ESP32S3WebServerProject/Software/ESP32S3WebserverProject/ESP32S3WebserverProject.ino
                if((fsNum>=0)&&(dir>"")&&(fname>"")){
                  sprintf(fullPath,"%s%s%s",dir,dir[strlen(dir)-1]=='/' ? "" : "/", fname);
                  FMdelete(fsNum,fullPath);
                  client->text(FMgetDir(filesys,dir));
                }
              }
              handled = true;
            }
            if((!handled) && strcmp(request,"FMuploadBegin") == 0){
              // Client will be uploading a file and wants the server to track the status.
              const char *path = doc["path"];
              const unsigned int siz = doc["size"];
              createUpload((char*)path, (unsigned int)siz);
              handled = true;
            }
            if((!handled) && strcmp(request,"FMuploadEnd") == 0){
              // Client knows/confirms uploading is finished, free up this slot in the upload structure
              const char *path = doc["path"];
              deleteUpload((char*)path);
              handled = true;
            }
            if((!handled) && strcmp(request,"FMuploadStatus") == 0){
              // Client requests the status of this upload
              const char *path = doc["path"];
              char stat[100];
              statusUpload((char*)path, stat);
              client->text(stat);
              handled = true;
            }
#endif // UseFileManager
          }
        }
      } else {
      getOperand(operand, (char*)data, sizeof(operand));
      if(strcmp(operand,"getHostSettings") == 0){
        char rsvp[1000] = "";                   // Buffer to hold host settings
        if((!onlyLocalAdmin) || isLocal(client->remoteIP())){
          // Client has requested host settings.   This event is used within /admin.htm
          getHostSettings(rsvp);
          client->text(rsvp);
        }
        handled = true;
      }
      if((!handled) && strcmp(operand,"setHostSettings") == 0){
        // Client wishes to change host settings   This event is used within /admin.htm
        char rsvp[200] = "";                    // Buffer to hold response for client
        if((!onlyLocalAdmin) || isLocal(client->remoteIP())){
          if(setHostSettings((char*)data,rsvp)){  // If errors, messages will be returned in rsvp.
             sprintf(rsvp,"Message\nConfiguration changed. Rebooting. You will be disconnected.");
            client->text(rsvp);
            serialPrint("Rebooting after admin configuration change\n",true);
            delay(1000);
            ESP.restart();
          }else{
            strcat(rsvp,"\nConfiguration changes ignored");
            client->text(rsvp);
          }
        }
        handled = true;
      }

      if((!handled) && strcmp(operand,"getDateTime") == 0){
        // Client has requested date and time settings   This event is used in /admin.htm. Could be used in custom pages as well.
        char rsvp[500];
        getDateTimeSettings(rsvp,false);
        client->text(rsvp);
        handled = true;
      }

      if((!handled) && strcmp(operand,"setDateTime") == 0){
        // Client wishes to change date and time settings  This event is used in /admin.htm
        char rsvp[200] = "";
        if((!onlyLocalAdmin) || isLocal(client->remoteIP())){
          if(setDateTimeSettings((char*)data,rsvp)){  // If errors, messages will be returned in rsvp
            sprintf(rsvp,"Message2\nDate and Time configuration changed.");
            client->text(rsvp);
          }else{
            strcat(rsvp,"\nDate and Time changes ignored");
            client->text(rsvp);
          }
        }
        handled = true;
      }
    }
    }
  }
  if(!handled){
    customWS_EVT(server, client, type, arg, data, len);
  }
}

// Gets the "name" or "Identifier" of the data event received
// It is terminated either with a zero, or a carriage return (\r)
void getOperand(char operand[], char input[], int maxLen){
  for(int i = 0; i < maxLen; i++){
    operand[i] = input[i];
    if(operand[i] == '\r')
      operand[i] = 0;
    if(operand[i] == 0)
      break;
  }
}

// Assembles a response for the getHostSettings request
void getHostSettings(char rsvp[]){
  sprintf(rsvp,"setHostSettings\n%s\n%s\n%s\n%s\n%s\n%s\n%s",
          hostname, beacon ? "1" : "0",appasswd,ssid,password,adminUsername,adminPassword);
}

// Build up a websocket message response to send date and time settings to client
void getDateTimeSettings(char rsvp[], bool json){
  char pattern[100];
  if(json){
    strcpy(pattern, "{\"answer\":\"setDateTime\",\"timezone\":\"%s\",\"ntpserver\":\"%s\",\"time\":\"%s\",\"comment\":\"%s\"}");
  }else {
    strcpy(pattern, "setDateTime\n%s\n%s\n%s\n%s");
  }
  getLocalTime(&currentTime,NULL);
  char dttms[20];
  sprintf(dttms,"%04i%02i%02i%02i%02i%02i",
    currentTime.tm_year + 1900,
    currentTime.tm_mon  + 1,
    currentTime.tm_mday,
    currentTime.tm_hour,
    currentTime.tm_min,
    currentTime.tm_sec);
  sprintf(rsvp,pattern,timezone,ntpserver,dttms, WiFi.status() != WL_CONNECTED ? "No WiFi, time cannot synch" : "");
}

// Handle changing host settings as specified by client in /admin.htm
bool setHostSettings(char *params, char msg[]){
  char* p[7]; // 7 Values will be received. Host, Broadcast, APPasswd, WiFiSSID, WiFiPasswd, AdminName, AdminPasswd
  int cnt = 0;
  bool retVal = false;                         // Assuming that not all tests pass
  msg[0] = 0;
  strcat(msg,"Message\n");
  strtok(params, "\n");                        // "setHostSettings". Return value not necessary
  for(int i = 0; i < 7; i++){                      // Pull in the 7 values
    p[i] = strtok(NULL,"\n");                  // They are delimited with \n
    if(p[i] > "") cnt++;
  };

  if(cnt < 5){                                 // First test, at least 5 values received? (SSID & password are optional!)
    strcat(msg,"Configuration is incomplete. ");
    return retVal;
  }
  if(strlen(p[0]) < 4)                         // Hostname must be at least 4 characters long
    return retVal;

  if(!((p[0][0] >= 'A' && p[0][0] <= 'Z') || (p[0][0] >= 'a' && p[0][0] <= 'z'))){
    strcat(msg,"Hostname must begin with a letter. ");
    return retVal;
  }

  if(strlen(p[2])<8 || strlen(p[2])>16){       // Password for access point must be at least 8 characters (rule in library!)
    strcat(msg,"Invalid AP Password. ");
    return retVal;
  }

  if(strlen(p[4]) > 0 && strlen(p[3]) == 0)    // If no SSID is given but a password is
    p[4][0] = 0;                               // Chop the password out

  if(strlen(p[5])<6 || strlen(p[5])>16){       // Admin name must be 6-16 characters long
    strcat(msg,"Invalid Admin Name. ");
    return retVal;
  }

  if(!((p[5][0] >= 'A' && p[5][0] <= 'Z') || (p[5][0] >= 'a' && p[5][0] <= 'z'))){
    strcat(msg,"Admin Name must begin with a letter. ");
    return retVal;
  }

  if(strlen(p[6])<8 || strlen(p[6])>16){       // Admin password must be 8-16 characters long
    strcat(msg,"Invalid Admin Password. ");
    return retVal;
  }

  Preferences param;
  param.begin(params,false);                   // use "param" preference namespace, readOnly = false means read/write allowed

  updateHostName(p[0], &param);
  updateBeacon(!(p[1][0] == '1'), &param);     // This byte is 0 for no beacon (AP not broadcast), 1 for beacon (AP broadcast)
  updateAPpassword(p[2], &param);
  updateSSID(p[3], &param);
  updatePassword(p[4], &param);
  updateAdminName(p[5], &param);
  updateAdminPassword(p[6], &param);

  retVal = true;
  return retVal;
}

// Handle changing time settings as specified by client in /admin.htm
bool setDateTimeSettings(char *params, char msg[]){
  char* p[2];                                  // Timezone, NTP Server
  int i = 0;
  int cnt = 0;
  bool retVal = false;                         // Assuming that not all tests will pass
  msg[0] = 0;
  strcat(msg,"Message2\n");
  strtok(params, "\n");                        // "setTimeSettings". Return value not necessary
  for(i = 0; i < 2; i++){                      // Pull in both parameters
    p[i] = strtok(NULL,"\n");
    if(p[i]>"")cnt++;
  };

  if(cnt < 2){                                 // First test, 2 values received?
    strcat(msg,"Time/date settings are incomplete. ");
    return retVal;
  }
  if(strlen(p[0]) < 4){                       // Timezone must be at least 4 characters long
    strcat(msg,"Invalid time zone. ");
    return retVal;
  }

  if(strlen(p[1])<8 || strlen(p[1])>16){      // NTP server must be 8-16 characters (pool.ntp.org should be shortest)
    strcat(msg,"Invalid time server. ");
    return retVal;
  }

  Preferences param;
  param.begin(params,false);                   // use "param" preference namespace, readOnly = false means read/write allowed

  updateTimezone(p[0], &param);
  updateNTPServer(p[1], &param);
  // (Falsely) Claim that the last NTP Synch was 30 days ago to force an update in loop.
  lastNTPSynch = millis() - 1000 * 60 * 60 * 24 * 30;

  retVal = true;
  return retVal;
}

// Because Serial.print AND SerialWS.print are both to be supported, all prints will be routed through these functions
// which will send the prints to one and/or the other.
// To keep this simple, only printing of strings and ints will be supported
// NOTE: SerialWS CAN support receiving from the SerialWS Monitor, but this application doesn't
// use receiving at all. It only uses SerialWS and/or Serial to output information to the serial monitor.
void serialPrint(char buff[], bool immediate){
#if serialEnabled
  Serial.print(buff);
#endif  
#if useSerialWS
  serialWS.print(buff);
  if(immediate)serialWS.send();
#endif  
}
void serialPrint(int val, bool immediate){
#if serialEnabled
  Serial.print(val);
#endif  
#if useSerialWS
  serialWS.print(val);
  if(immediate)serialWS.send();
#endif  
}
void serialPrintln(char buff[], bool immediate){
  serialPrint(buff, false);
  serialPrint("\n", immediate);
}
void serialPrintln(int val, bool immediate){
  serialPrint(val, false);
  serialPrint("\n", immediate);
}

void validateFiles(){
  FS *fs;
  #if StandardFiles == onSD
    fs = &SD;
    char sys[] = "SD";
  #elif StandardFiles == onLFS
    fs = &LittleFS;
    char sys[] = "LittleFS";
  #endif
  checkForFile(fs, sys, DefaultHTM);     // Default webpage when webserver is accessed (typically index.htm, main.htm, etc.) Remember the preceding slash!
  checkForFile(fs, sys, FavIcon);        // File for favicon (typically *.ico, *.jpg, *.png, or *.bmp)
  checkForFile(fs, sys, AdminHTM);       // File for admin webpage
  #if UseFileManager
    checkForFile(fs, sys, FilAdminHTM);  // File for file manager webpage
  #endif
  #if useSerialWS
    checkForFile(fs, sys, SerialHTM);    // File for SerialWS webpage
  #endif
}

void checkForFile(FS *fs_, char sys[], char filepath[]){
  if(!fs_->exists(filepath)){
    char buff[500];
    snprintf(buff, 500, "Warning: File %s is missing on %s\n", filepath, sys);
    serialPrint(buff,true);
  }
}
